espressif/esp-idf/components/soc/esp32p4/include/soc/slc_reg.h
/** SDIO_SLC0TOKEN1_REG register
 *  reserved
 */
#define SDIO_SLC0TOKEN1_REG (DR_REG_SLC_BASE + 0x64)
/** SDIO_SLC0_TOKEN1_WDATA : WT; bitpos: [11:0]; default: 0;
 *  slc0 token1 wdata
 */
#define SDIO_SLC0_TOKEN1_WDATA    0x00000FFFU
#define SDIO_SLC0_TOKEN1_WDATA_M  (SDIO_SLC0_TOKEN1_WDATA_V << SDIO_SLC0_TOKEN1_WDATA_S)
#define SDIO_SLC0_TOKEN1_WDATA_V  0x00000FFFU
#define SDIO_SLC0_TOKEN1_WDATA_S  0
/** SDIO_SLC0_TOKEN1_WR : WT; bitpos: [12]; default: 0;
 *  update slc0_token1_wdata into slc0 token1
 */
#define SDIO_SLC0_TOKEN1_WR    (BIT(12))
#define SDIO_SLC0_TOKEN1_WR_M  (SDIO_SLC0_TOKEN1_WR_V << SDIO_SLC0_TOKEN1_WR_S)
#define SDIO_SLC0_TOKEN1_WR_V  0x00000001U
#define SDIO_SLC0_TOKEN1_WR_S  12
/** SDIO_SLC0_TOKEN1_INC : WT; bitpos: [13]; default: 0;
 *  slc0_token1 becomes to 1 when auto clear slc0_token1, else add 1 to slc0_token1
 */
#define SDIO_SLC0_TOKEN1_INC    (BIT(13))
#define SDIO_SLC0_TOKEN1_INC_M  (SDIO_SLC0_TOKEN1_INC_V << SDIO_SLC0_TOKEN1_INC_S)
#define SDIO_SLC0_TOKEN1_INC_V  0x00000001U
#define SDIO_SLC0_TOKEN1_INC_S  13
/** SDIO_SLC0_TOKEN1_INC_MORE : WT; bitpos: [14]; default: 0;
 *  slc0_token1 becomes to slc0_token1_wdata when auto clear slc0_token1, else add
 *  slc0_token1_wdata to slc0_token1
 */
#define SDIO_SLC0_TOKEN1_INC_MORE    (BIT(14))
#define SDIO_SLC0_TOKEN1_INC_MORE_M  (SDIO_SLC0_TOKEN1_INC_MORE_V << SDIO_SLC0_TOKEN1_INC_MORE_S)
#define SDIO_SLC0_TOKEN1_INC_MORE_V  0x00000001U
#define SDIO_SLC0_TOKEN1_INC_MORE_S  14
/** SDIO_SLC0_TOKEN1 : RO; bitpos: [27:16]; default: 0;
 *  reserved
 */
#define SDIO_SLC0_TOKEN1    0x00000FFFU
#define SDIO_SLC0_TOKEN1_M  (SDIO_SLC0_TOKEN1_V << SDIO_SLC0_TOKEN1_S)
#define SDIO_SLC0_TOKEN1_V  0x00000FFFU
#define SDIO_SLC0_TOKEN1_S  16

/** SDIO_SLC1TOKEN0_REG register
 *  ******* Description ***********
 */
#define SDIO_SLC1TOKEN0_REG (DR_REG_SLC_BASE + 0x68)
/** SDIO_SLC1_TOKEN0_WDATA : WT; bitpos: [11:0]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_TOKEN0_WDATA    0x00000FFFU
#define SDIO_SLC1_TOKEN0_WDATA_M  (SDIO_SLC1_TOKEN0_WDATA_V << SDIO_SLC1_TOKEN0_WDATA_S)
#define SDIO_SLC1_TOKEN0_WDATA_V  0x00000FFFU
#define SDIO_SLC1_TOKEN0_WDATA_S  0
/** SDIO_SLC1_TOKEN0_WR : WT; bitpos: [12]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_TOKEN0_WR    (BIT(12))
#define SDIO_SLC1_TOKEN0_WR_M  (SDIO_SLC1_TOKEN0_WR_V << SDIO_SLC1_TOKEN0_WR_S)
#define SDIO_SLC1_TOKEN0_WR_V  0x00000001U
#define SDIO_SLC1_TOKEN0_WR_S  12
/** SDIO_SLC1_TOKEN0_INC : WT; bitpos: [13]; default: 0;
 *  Add 1 to  slc1_token0
 */
#define SDIO_SLC1_TOKEN0_INC    (BIT(13))
#define SDIO_SLC1_TOKEN0_INC_M  (SDIO_SLC1_TOKEN0_INC_V << SDIO_SLC1_TOKEN0_INC_S)
#define SDIO_SLC1_TOKEN0_INC_V  0x00000001U
#define SDIO_SLC1_TOKEN0_INC_S  13
/** SDIO_SLC1_TOKEN0_INC_MORE : WT; bitpos: [14]; default: 0;
 *  Add  slc1_token0_wdata to  slc1_token0
 */
#define SDIO_SLC1_TOKEN0_INC_MORE    (BIT(14))
#define SDIO_SLC1_TOKEN0_INC_MORE_M  (SDIO_SLC1_TOKEN0_INC_MORE_V << SDIO_SLC1_TOKEN0_INC_MORE_S)
#define SDIO_SLC1_TOKEN0_INC_MORE_V  0x00000001U
#define SDIO_SLC1_TOKEN0_INC_MORE_S  14
/** SDIO_SLC1_TOKEN0 : RO; bitpos: [27:16]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_TOKEN0    0x00000FFFU
#define SDIO_SLC1_TOKEN0_M  (SDIO_SLC1_TOKEN0_V << SDIO_SLC1_TOKEN0_S)
#define SDIO_SLC1_TOKEN0_V  0x00000FFFU
#define SDIO_SLC1_TOKEN0_S  16

/** SDIO_SLC1TOKEN1_REG register
 *  reserved
 */
#define SDIO_SLC1TOKEN1_REG (DR_REG_SLC_BASE + 0x6c)
/** SDIO_SLC1_TOKEN1_WDATA : WT; bitpos: [11:0]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_TOKEN1_WDATA    0x00000FFFU
#define SDIO_SLC1_TOKEN1_WDATA_M  (SDIO_SLC1_TOKEN1_WDATA_V << SDIO_SLC1_TOKEN1_WDATA_S)
#define SDIO_SLC1_TOKEN1_WDATA_V  0x00000FFFU
#define SDIO_SLC1_TOKEN1_WDATA_S  0
/** SDIO_SLC1_TOKEN1_WR : WT; bitpos: [12]; default: 0;
 *  update slc1_token1_wdata into slc1 token1
 */
#define SDIO_SLC1_TOKEN1_WR    (BIT(12))
#define SDIO_SLC1_TOKEN1_WR_M  (SDIO_SLC1_TOKEN1_WR_V << SDIO_SLC1_TOKEN1_WR_S)
#define SDIO_SLC1_TOKEN1_WR_V  0x00000001U
#define SDIO_SLC1_TOKEN1_WR_S  12
/** SDIO_SLC1_TOKEN1_INC : WT; bitpos: [13]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_TOKEN1_INC    (BIT(13))
#define SDIO_SLC1_TOKEN1_INC_M  (SDIO_SLC1_TOKEN1_INC_V << SDIO_SLC1_TOKEN1_INC_S)
#define SDIO_SLC1_TOKEN1_INC_V  0x00000001U
#define SDIO_SLC1_TOKEN1_INC_S  13
/** SDIO_SLC1_TOKEN1_INC_MORE : WT; bitpos: [14]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_TOKEN1_INC_MORE    (BIT(14))
#define SDIO_SLC1_TOKEN1_INC_MORE_M  (SDIO_SLC1_TOKEN1_INC_MORE_V << SDIO_SLC1_TOKEN1_INC_MORE_S)
#define SDIO_SLC1_TOKEN1_INC_MORE_V  0x00000001U
#define SDIO_SLC1_TOKEN1_INC_MORE_S  14
/** SDIO_SLC1_TOKEN1 : RO; bitpos: [27:16]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_TOKEN1    0x00000FFFU
#define SDIO_SLC1_TOKEN1_M  (SDIO_SLC1_TOKEN1_V << SDIO_SLC1_TOKEN1_S)
#define SDIO_SLC1_TOKEN1_V  0x00000FFFU
#define SDIO_SLC1_TOKEN1_S  16

/** SDIO_SLCCONF1_REG register
 *  reserved
 */
#define SDIO_SLCCONF1_REG (DR_REG_SLC_BASE + 0x70)
/** SDIO_SLC0_CHECK_OWNER : R/W; bitpos: [0]; default: 0;
 *  reserved
 */
#define SDIO_SLC0_CHECK_OWNER    (BIT(0))
#define SDIO_SLC0_CHECK_OWNER_M  (SDIO_SLC0_CHECK_OWNER_V << SDIO_SLC0_CHECK_OWNER_S)
#define SDIO_SLC0_CHECK_OWNER_V  0x00000001U
#define SDIO_SLC0_CHECK_OWNER_S  0
/** SDIO_SLC0_TX_CHECK_SUM_EN : R/W; bitpos: [1]; default: 0;
 *  reserved
 */
#define SDIO_SLC0_TX_CHECK_SUM_EN    (BIT(1))
#define SDIO_SLC0_TX_CHECK_SUM_EN_M  (SDIO_SLC0_TX_CHECK_SUM_EN_V << SDIO_SLC0_TX_CHECK_SUM_EN_S)
#define SDIO_SLC0_TX_CHECK_SUM_EN_V  0x00000001U
#define SDIO_SLC0_TX_CHECK_SUM_EN_S  1
/** SDIO_SLC0_RX_CHECK_SUM_EN : R/W; bitpos: [2]; default: 0;
 *  reserved
 */
#define SDIO_SLC0_RX_CHECK_SUM_EN    (BIT(2))
#define SDIO_SLC0_RX_CHECK_SUM_EN_M  (SDIO_SLC0_RX_CHECK_SUM_EN_V << SDIO_SLC0_RX_CHECK_SUM_EN_S)
#define SDIO_SLC0_RX_CHECK_SUM_EN_V  0x00000001U
#define SDIO_SLC0_RX_CHECK_SUM_EN_S  2
/** SDIO_SDIO_CMD_HOLD_EN : R/W; bitpos: [3]; default: 1;
 *  reserved
 */
#define SDIO_SDIO_CMD_HOLD_EN    (BIT(3))
#define SDIO_SDIO_CMD_HOLD_EN_M  (SDIO_SDIO_CMD_HOLD_EN_V << SDIO_SDIO_CMD_HOLD_EN_S)
#define SDIO_SDIO_CMD_HOLD_EN_V  0x00000001U
#define SDIO_SDIO_CMD_HOLD_EN_S  3
/** SDIO_SLC0_LEN_AUTO_CLR : R/W; bitpos: [4]; default: 1;
 *  reserved
 */
#define SDIO_SLC0_LEN_AUTO_CLR    (BIT(4))
#define SDIO_SLC0_LEN_AUTO_CLR_M  (SDIO_SLC0_LEN_AUTO_CLR_V << SDIO_SLC0_LEN_AUTO_CLR_S)
#define SDIO_SLC0_LEN_AUTO_CLR_V  0x00000001U
#define SDIO_SLC0_LEN_AUTO_CLR_S  4
/** SDIO_SLC0_TX_STITCH_EN : R/W; bitpos: [5]; default: 1;
 *  reserved
 */
#define SDIO_SLC0_TX_STITCH_EN    (BIT(5))
#define SDIO_SLC0_TX_STITCH_EN_M  (SDIO_SLC0_TX_STITCH_EN_V << SDIO_SLC0_TX_STITCH_EN_S)
#define SDIO_SLC0_TX_STITCH_EN_V  0x00000001U
#define SDIO_SLC0_TX_STITCH_EN_S  5
/** SDIO_SLC0_RX_STITCH_EN : R/W; bitpos: [6]; default: 1;
 *  reserved
 */
#define SDIO_SLC0_RX_STITCH_EN    (BIT(6))
#define SDIO_SLC0_RX_STITCH_EN_M  (SDIO_SLC0_RX_STITCH_EN_V << SDIO_SLC0_RX_STITCH_EN_S)
#define SDIO_SLC0_RX_STITCH_EN_V  0x00000001U
#define SDIO_SLC0_RX_STITCH_EN_S  6
/** SDIO_SLC1_CHECK_OWNER : R/W; bitpos: [16]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_CHECK_OWNER    (BIT(16))
#define SDIO_SLC1_CHECK_OWNER_M  (SDIO_SLC1_CHECK_OWNER_V << SDIO_SLC1_CHECK_OWNER_S)
#define SDIO_SLC1_CHECK_OWNER_V  0x00000001U
#define SDIO_SLC1_CHECK_OWNER_S  16
/** SDIO_SLC1_TX_CHECK_SUM_EN : R/W; bitpos: [17]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_TX_CHECK_SUM_EN    (BIT(17))
#define SDIO_SLC1_TX_CHECK_SUM_EN_M  (SDIO_SLC1_TX_CHECK_SUM_EN_V << SDIO_SLC1_TX_CHECK_SUM_EN_S)
#define SDIO_SLC1_TX_CHECK_SUM_EN_V  0x00000001U
#define SDIO_SLC1_TX_CHECK_SUM_EN_S  17
/** SDIO_SLC1_RX_CHECK_SUM_EN : R/W; bitpos: [18]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_RX_CHECK_SUM_EN    (BIT(18))
#define SDIO_SLC1_RX_CHECK_SUM_EN_M  (SDIO_SLC1_RX_CHECK_SUM_EN_V << SDIO_SLC1_RX_CHECK_SUM_EN_S)
#define SDIO_SLC1_RX_CHECK_SUM_EN_V  0x00000001U
#define SDIO_SLC1_RX_CHECK_SUM_EN_S  18
/** SDIO_HOST_INT_LEVEL_SEL : R/W; bitpos: [19]; default: 0;
 *  reserved
 */
#define SDIO_HOST_INT_LEVEL_SEL    (BIT(19))
#define SDIO_HOST_INT_LEVEL_SEL_M  (SDIO_HOST_INT_LEVEL_SEL_V << SDIO_HOST_INT_LEVEL_SEL_S)
#define SDIO_HOST_INT_LEVEL_SEL_V  0x00000001U
#define SDIO_HOST_INT_LEVEL_SEL_S  19
/** SDIO_SLC1_TX_STITCH_EN : R/W; bitpos: [20]; default: 1;
 *  reserved
 */
#define SDIO_SLC1_TX_STITCH_EN    (BIT(20))
#define SDIO_SLC1_TX_STITCH_EN_M  (SDIO_SLC1_TX_STITCH_EN_V << SDIO_SLC1_TX_STITCH_EN_S)
#define SDIO_SLC1_TX_STITCH_EN_V  0x00000001U
#define SDIO_SLC1_TX_STITCH_EN_S  20
/** SDIO_SLC1_RX_STITCH_EN : R/W; bitpos: [21]; default: 1;
 *  reserved
 */
#define SDIO_SLC1_RX_STITCH_EN    (BIT(21))
#define SDIO_SLC1_RX_STITCH_EN_M  (SDIO_SLC1_RX_STITCH_EN_V << SDIO_SLC1_RX_STITCH_EN_S)
#define SDIO_SLC1_RX_STITCH_EN_V  0x00000001U
#define SDIO_SLC1_RX_STITCH_EN_S  21
/** SDIO_SDIO_CLK_EN : R/W; bitpos: [22]; default: 0;
 *  reserved
 */
#define SDIO_SDIO_CLK_EN    (BIT(22))
#define SDIO_SDIO_CLK_EN_M  (SDIO_SDIO_CLK_EN_V << SDIO_SDIO_CLK_EN_S)
#define SDIO_SDIO_CLK_EN_V  0x00000001U
#define SDIO_SDIO_CLK_EN_S  22

/** SDIO_SLC0_STATE0_REG register
 *  reserved
 */
#define SDIO_SLC0_STATE0_REG (DR_REG_SLC_BASE + 0x74)
/** SDIO_SLC0_STATE0 : RO; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define SDIO_SLC0_STATE0    0xFFFFFFFFU
#define SDIO_SLC0_STATE0_M  (SDIO_SLC0_STATE0_V << SDIO_SLC0_STATE0_S)
#define SDIO_SLC0_STATE0_V  0xFFFFFFFFU
#define SDIO_SLC0_STATE0_S  0

/** SDIO_SLC0_STATE1_REG register
 *  ******* Description ***********
 */
#define SDIO_SLC0_STATE1_REG (DR_REG_SLC_BASE + 0x78)
/** SDIO_SLC0_STATE1 : RO; bitpos: [31:0]; default: 0;
 *  [18:0] the current rx descriptor address, [20:19] rx_dscr fsm state, [23:21]
 *  rx_link fsm state, [30:24] rx_fifo_cnt
 */
#define SDIO_SLC0_STATE1    0xFFFFFFFFU
#define SDIO_SLC0_STATE1_M  (SDIO_SLC0_STATE1_V << SDIO_SLC0_STATE1_S)
#define SDIO_SLC0_STATE1_V  0xFFFFFFFFU
#define SDIO_SLC0_STATE1_S  0

/** SDIO_SLC1_STATE0_REG register
 *  ******* Description ***********
 */
#define SDIO_SLC1_STATE0_REG (DR_REG_SLC_BASE + 0x7c)
/** SDIO_SLC1_STATE0 : RO; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_STATE0    0xFFFFFFFFU
#define SDIO_SLC1_STATE0_M  (SDIO_SLC1_STATE0_V << SDIO_SLC1_STATE0_S)
#define SDIO_SLC1_STATE0_V  0xFFFFFFFFU
#define SDIO_SLC1_STATE0_S  0

/** SDIO_SLC1_STATE1_REG register
 *  ******* Description ***********
 */
#define SDIO_SLC1_STATE1_REG (DR_REG_SLC_BASE + 0x80)
/** SDIO_SLC1_STATE1 : RO; bitpos: [31:0]; default: 0;
 *  [18:0] the current rx descriptor address, [20:19] rx_dscr fsm state, [23:21]
 *  rx_link fsm state, [30:24] rx_fifo_cnt
 */
#define SDIO_SLC1_STATE1    0xFFFFFFFFU
#define SDIO_SLC1_STATE1_M  (SDIO_SLC1_STATE1_V << SDIO_SLC1_STATE1_S)
#define SDIO_SLC1_STATE1_V  0xFFFFFFFFU
#define SDIO_SLC1_STATE1_S  0

/** SDIO_SLCBRIDGE_CONF_REG register
 *  ******* Description ***********
 */
#define SDIO_SLCBRIDGE_CONF_REG (DR_REG_SLC_BASE + 0x84)
/** SDIO_SLC_TXEOF_ENA : R/W; bitpos: [5:0]; default: 32;
 *  reserved
 */
#define SDIO_SLC_TXEOF_ENA    0x0000003FU
#define SDIO_SLC_TXEOF_ENA_M  (SDIO_SLC_TXEOF_ENA_V << SDIO_SLC_TXEOF_ENA_S)
#define SDIO_SLC_TXEOF_ENA_V  0x0000003FU
#define SDIO_SLC_TXEOF_ENA_S  0
/** SDIO_SLC_FIFO_MAP_ENA : R/W; bitpos: [11:8]; default: 7;
 *  reserved
 */
#define SDIO_SLC_FIFO_MAP_ENA    0x0000000FU
#define SDIO_SLC_FIFO_MAP_ENA_M  (SDIO_SLC_FIFO_MAP_ENA_V << SDIO_SLC_FIFO_MAP_ENA_S)
#define SDIO_SLC_FIFO_MAP_ENA_V  0x0000000FU
#define SDIO_SLC_FIFO_MAP_ENA_S  8
/** SDIO_SLC0_TX_DUMMY_MODE : R/W; bitpos: [12]; default: 1;
 *  reserved
 */
#define SDIO_SLC0_TX_DUMMY_MODE    (BIT(12))
#define SDIO_SLC0_TX_DUMMY_MODE_M  (SDIO_SLC0_TX_DUMMY_MODE_V << SDIO_SLC0_TX_DUMMY_MODE_S)
#define SDIO_SLC0_TX_DUMMY_MODE_V  0x00000001U
#define SDIO_SLC0_TX_DUMMY_MODE_S  12
/** SDIO_SLC_HDA_MAP_128K : R/W; bitpos: [13]; default: 1;
 *  reserved
 */
#define SDIO_SLC_HDA_MAP_128K    (BIT(13))
#define SDIO_SLC_HDA_MAP_128K_M  (SDIO_SLC_HDA_MAP_128K_V << SDIO_SLC_HDA_MAP_128K_S)
#define SDIO_SLC_HDA_MAP_128K_V  0x00000001U
#define SDIO_SLC_HDA_MAP_128K_S  13
/** SDIO_SLC1_TX_DUMMY_MODE : R/W; bitpos: [14]; default: 1;
 *  reserved
 */
#define SDIO_SLC1_TX_DUMMY_MODE    (BIT(14))
#define SDIO_SLC1_TX_DUMMY_MODE_M  (SDIO_SLC1_TX_DUMMY_MODE_V << SDIO_SLC1_TX_DUMMY_MODE_S)
#define SDIO_SLC1_TX_DUMMY_MODE_V  0x00000001U
#define SDIO_SLC1_TX_DUMMY_MODE_S  14
/** SDIO_SLC_TX_PUSH_IDLE_NUM : R/W; bitpos: [31:16]; default: 10;
 *  reserved
 */
#define SDIO_SLC_TX_PUSH_IDLE_NUM    0x0000FFFFU
#define SDIO_SLC_TX_PUSH_IDLE_NUM_M  (SDIO_SLC_TX_PUSH_IDLE_NUM_V << SDIO_SLC_TX_PUSH_IDLE_NUM_S)
#define SDIO_SLC_TX_PUSH_IDLE_NUM_V  0x0000FFFFU
#define SDIO_SLC_TX_PUSH_IDLE_NUM_S  16

/** SDIO_SLC0_TO_EOF_DES_ADDR_REG register
 *  reserved
 */
#define SDIO_SLC0_TO_EOF_DES_ADDR_REG (DR_REG_SLC_BASE + 0x88)
/** SDIO_SLC0_TO_EOF_DES_ADDR : RO; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define SDIO_SLC0_TO_EOF_DES_ADDR    0xFFFFFFFFU
#define SDIO_SLC0_TO_EOF_DES_ADDR_M  (SDIO_SLC0_TO_EOF_DES_ADDR_V << SDIO_SLC0_TO_EOF_DES_ADDR_S)
#define SDIO_SLC0_TO_EOF_DES_ADDR_V  0xFFFFFFFFU
#define SDIO_SLC0_TO_EOF_DES_ADDR_S  0

